"""
ఈ యంత్రలిపి తెలుఁగులోనొక యాదృచ్ఛిక పాఠ్యాన్ని వ్రాసుంది. 
దీనిని నడపడానికి పైతాను మూఁడు అవసరం. 
వాడుక నమూనా-
	python3 ఉత్తిమాటలు.py
లేదా 
	python3 ఉత్తిమాటలు.py > పాఠ్యం.txt
అని వాడుకోవచ్చు. 
రెండోవ విధానాన పాఠ్యం పాఠ్యం.txtలో భద్రపఱచబడుతుంది.
"""

from random import choice as ఎంపిక
from random import random as యాదృచ్ఛికం

రేంజి = range
ౘూపీ = print

ఉభయాలు = 'ఁంః'
అచ్చులు = 'అఆఇఈఉఊఋఌౠౡఎఏఐఒఓఔ'
హల్లులు = 'కఖగఘఙచఛజఝఞటఠడఢణతథదధనపఫబభమయరఱలళఴవశషసహౘౙ'
గుణింతాలు = 'ాిీుూృౄౢౣెేైొోౌ్ '
అంకెలు = '౦౧౨౩౪౫౬౭౮౯'
భిన్నంకెలు = '౸౹౺౻౼౽౾౿'
అవగ్రహం = 'ఽ'

def ఒక_అచ్చు():
	ఫలితం = ఎంపిక(అచ్చులు)
	if యాదృచ్ఛికం() > .75:
		ఫలితం += ఎంపిక(ఉభయాలు)
	return ఫలితం

def ఒక_హల్లు():
	ఫలితం = ఎంపిక(హల్లులు)
	while యాదృచ్ఛికం() > .9:
		ఫలితం += '్' + ఎంపిక(హల్లులు)
	if యాదృచ్ఛికం() > .1:
		ఫలితం += ఎంపిక(గుణింతాలు)
	if యాదృచ్ఛికం() < 1e-4 and ఫలితం[-1] != '':
		ఫలితం += అవగ్రహం
	return ఫలితం

def ఇతరము():
	return ఎంపిక(అంకెలు + భిన్నంకెలు)

def ఒక_పదం():
	ఫలితం = ''
	if యాదృచ్ఛికం() < .25:
		ఫలితం += ఒక_అచ్చు()
	while యాదృచ్ఛికం() > 1/4:
		ఫలితం += ఒక_హల్లు()
	return ఫలితం + ' '

for పంక్తి in రేంజి(9):
	ౘూపీ()
	for పదం in రేంజి(9):
		ౘూపీ(ఒక_పదం(), end='')
